# SQL

In [2]:
import pandas as pd
import sqlite3
conn = sqlite3.connect("../../data/soccer.sqlite")

In [3]:
league_df = pd.read_sql(
    '''
    SELECT l.id, l.name, c.name as country_name
    FROM League l
    JOIN Country c ON c.id = l.country_id
    ''', conn)

In [5]:
league_df.head()

      id                    name country_name
0      1  Belgium Jupiler League      Belgium
1   1729  England Premier League      England
2   4769          France Ligue 1       France
3   7809   Germany 1. Bundesliga      Germany
4  10257           Italy Serie A        Italy